input: "data"
input_dim: 1
input_dim: 4
input_dim: 256
input_dim: 256
layer {
  name: "image"
  type: "Slice"
  bottom: "data"
  top: "image"
  top: "center_map"
  slice_param {
    slice_point: 3
    axis: 1
  }
}
layer {
 name: "conv_1"
 type: "Convolution"
 bottom: "image"
 top: "conv_1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 64
 pad: 3
 kernel_size: 7
 stride:2
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "bn_1"
 type: "BatchNorm"
 bottom: "conv_1"
 top: "bn_1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "scale_1"
 type: "Scale"
 bottom: "bn_1"
 top: "scale_1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "residual_1_branch1_bn1"
 type: "BatchNorm"
 bottom: "scale_1"
 top: "residual_1_branch1_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "residual_1_branch1_scale1"
 type: "Scale"
 bottom: "residual_1_branch1_bn1"
 top: "residual_1_branch1_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "residual_1_branch1_relu1"
 type: "ReLU"
 bottom: "residual_1_branch1_scale1"
 top: "residual_1_branch1_relu1"
}
layer {
 name: "residual_1_branch1_conv1"
 type: "Convolution"
 bottom: "residual_1_branch1_relu1"
 top: "residual_1_branch1_conv1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 64
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_1_branch1_bn2"
 type: "BatchNorm"
 bottom: "residual_1_branch1_conv1"
 top: "residual_1_branch1_bn2"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "residual_1_branch1_scale2"
 type: "Scale"
 bottom: "residual_1_branch1_bn2"
 top: "residual_1_branch1_scale2"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "residual_1_branch1_relu2"
 type: "ReLU"
 bottom: "residual_1_branch1_scale2"
 top: "residual_1_branch1_relu2"
}
layer {
 name: "residual_1_branch1_conv2"
 type: "Convolution"
 bottom: "residual_1_branch1_relu2"
 top: "residual_1_branch1_conv2"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 64
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_1_branch1_bn3"
 type: "BatchNorm"
 bottom: "residual_1_branch1_conv2"
 top: "residual_1_branch1_bn3"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "residual_1_branch1_scale3"
 type: "Scale"
 bottom: "residual_1_branch1_bn3"
 top: "residual_1_branch1_scale3"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "residual_1_branch1_relu3"
 type: "ReLU"
 bottom: "residual_1_branch1_scale3"
 top: "residual_1_branch1_relu3"
}
layer {
 name: "residual_1_branch1_conv3"
 type: "Convolution"
 bottom: "residual_1_branch1_relu3"
 top: "residual_1_branch1_conv3"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_1_branch2_conv"
 type: "Convolution"
 bottom: "scale_1"
 top: "residual_1_branch2_conv"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_1"
 type: "Eltwise"
 bottom: "residual_1_branch1_conv3"
 top: "residual_1"
 bottom: "residual_1_branch2_conv"
 eltwise_param {
 operation: SUM
 }
 }
layer {
 name: "pooling"
 type: "Pooling"
 bottom: "residual_1"
 top: "pooling"
 pooling_param {
 pool: MAX
 kernel_size: 2
 stride: 2
 }
 }
layer {
 name: "residual_2_branch1_bn1"
 type: "BatchNorm"
 bottom: "pooling"
 top: "residual_2_branch1_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "residual_2_branch1_scale1"
 type: "Scale"
 bottom: "residual_2_branch1_bn1"
 top: "residual_2_branch1_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "residual_2_branch1_relu1"
 type: "ReLU"
 bottom: "residual_2_branch1_scale1"
 top: "residual_2_branch1_relu1"
}
layer {
 name: "residual_2_branch1_conv1"
 type: "Convolution"
 bottom: "residual_2_branch1_relu1"
 top: "residual_2_branch1_conv1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 64
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_2_branch1_bn2"
 type: "BatchNorm"
 bottom: "residual_2_branch1_conv1"
 top: "residual_2_branch1_bn2"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "residual_2_branch1_scale2"
 type: "Scale"
 bottom: "residual_2_branch1_bn2"
 top: "residual_2_branch1_scale2"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "residual_2_branch1_relu2"
 type: "ReLU"
 bottom: "residual_2_branch1_scale2"
 top: "residual_2_branch1_relu2"
}
layer {
 name: "residual_2_branch1_conv2"
 type: "Convolution"
 bottom: "residual_2_branch1_relu2"
 top: "residual_2_branch1_conv2"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 64
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_2_branch1_bn3"
 type: "BatchNorm"
 bottom: "residual_2_branch1_conv2"
 top: "residual_2_branch1_bn3"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "residual_2_branch1_scale3"
 type: "Scale"
 bottom: "residual_2_branch1_bn3"
 top: "residual_2_branch1_scale3"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "residual_2_branch1_relu3"
 type: "ReLU"
 bottom: "residual_2_branch1_scale3"
 top: "residual_2_branch1_relu3"
}
layer {
 name: "residual_2_branch1_conv3"
 type: "Convolution"
 bottom: "residual_2_branch1_relu3"
 top: "residual_2_branch1_conv3"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_2_branch2_conv"
 type: "Convolution"
 bottom: "pooling"
 top: "residual_2_branch2_conv"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_2"
 type: "Eltwise"
 bottom: "residual_2_branch1_conv3"
 top: "residual_2"
 bottom: "residual_2_branch2_conv"
 eltwise_param {
 operation: SUM
 }
 }
layer {
 name: "residual_3_branch1_bn1"
 type: "BatchNorm"
 bottom: "residual_2"
 top: "residual_3_branch1_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "residual_3_branch1_scale1"
 type: "Scale"
 bottom: "residual_3_branch1_bn1"
 top: "residual_3_branch1_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "residual_3_branch1_relu1"
 type: "ReLU"
 bottom: "residual_3_branch1_scale1"
 top: "residual_3_branch1_relu1"
}
layer {
 name: "residual_3_branch1_conv1"
 type: "Convolution"
 bottom: "residual_3_branch1_relu1"
 top: "residual_3_branch1_conv1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 64
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_3_branch1_bn2"
 type: "BatchNorm"
 bottom: "residual_3_branch1_conv1"
 top: "residual_3_branch1_bn2"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "residual_3_branch1_scale2"
 type: "Scale"
 bottom: "residual_3_branch1_bn2"
 top: "residual_3_branch1_scale2"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "residual_3_branch1_relu2"
 type: "ReLU"
 bottom: "residual_3_branch1_scale2"
 top: "residual_3_branch1_relu2"
}
layer {
 name: "residual_3_branch1_conv2"
 type: "Convolution"
 bottom: "residual_3_branch1_relu2"
 top: "residual_3_branch1_conv2"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 64
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_3_branch1_bn3"
 type: "BatchNorm"
 bottom: "residual_3_branch1_conv2"
 top: "residual_3_branch1_bn3"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "residual_3_branch1_scale3"
 type: "Scale"
 bottom: "residual_3_branch1_bn3"
 top: "residual_3_branch1_scale3"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "residual_3_branch1_relu3"
 type: "ReLU"
 bottom: "residual_3_branch1_scale3"
 top: "residual_3_branch1_relu3"
}
layer {
 name: "residual_3_branch1_conv3"
 type: "Convolution"
 bottom: "residual_3_branch1_relu3"
 top: "residual_3_branch1_conv3"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_3_branch2_conv"
 type: "Convolution"
 bottom: "residual_2"
 top: "residual_3_branch2_conv"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_3"
 type: "Eltwise"
 bottom: "residual_3_branch1_conv3"
 top: "residual_3"
 bottom: "residual_3_branch2_conv"
 eltwise_param {
 operation: SUM
 }
 }
layer {
 name: "residual_4_branch1_bn1"
 type: "BatchNorm"
 bottom: "residual_3"
 top: "residual_4_branch1_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "residual_4_branch1_scale1"
 type: "Scale"
 bottom: "residual_4_branch1_bn1"
 top: "residual_4_branch1_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "residual_4_branch1_relu1"
 type: "ReLU"
 bottom: "residual_4_branch1_scale1"
 top: "residual_4_branch1_relu1"
}
layer {
 name: "residual_4_branch1_conv1"
 type: "Convolution"
 bottom: "residual_4_branch1_relu1"
 top: "residual_4_branch1_conv1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_4_branch1_bn2"
 type: "BatchNorm"
 bottom: "residual_4_branch1_conv1"
 top: "residual_4_branch1_bn2"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "residual_4_branch1_scale2"
 type: "Scale"
 bottom: "residual_4_branch1_bn2"
 top: "residual_4_branch1_scale2"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "residual_4_branch1_relu2"
 type: "ReLU"
 bottom: "residual_4_branch1_scale2"
 top: "residual_4_branch1_relu2"
}
layer {
 name: "residual_4_branch1_conv2"
 type: "Convolution"
 bottom: "residual_4_branch1_relu2"
 top: "residual_4_branch1_conv2"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_4_branch1_bn3"
 type: "BatchNorm"
 bottom: "residual_4_branch1_conv2"
 top: "residual_4_branch1_bn3"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "residual_4_branch1_scale3"
 type: "Scale"
 bottom: "residual_4_branch1_bn3"
 top: "residual_4_branch1_scale3"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "residual_4_branch1_relu3"
 type: "ReLU"
 bottom: "residual_4_branch1_scale3"
 top: "residual_4_branch1_relu3"
}
layer {
 name: "residual_4_branch1_conv3"
 type: "Convolution"
 bottom: "residual_4_branch1_relu3"
 top: "residual_4_branch1_conv3"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_4_branch2_conv"
 type: "Convolution"
 bottom: "residual_3"
 top: "residual_4_branch2_conv"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_4"
 type: "Eltwise"
 bottom: "residual_4_branch1_conv3"
 top: "residual_4"
 bottom: "residual_4_branch2_conv"
 eltwise_param {
 operation: SUM
 }
 }
layer {
 name: "hourglass1_pooling"
 type: "Pooling"
 bottom: "residual_4"
 top: "hourglass1_pooling"
 pooling_param {
 pool: MAX
 kernel_size: 2
 stride: 2
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_bn1"
 type: "BatchNorm"
 bottom: "hourglass1_pooling"
 top: "hourglass1_branch1_res1_branch1_sub1_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_scale1"
 type: "Scale"
 bottom: "hourglass1_branch1_res1_branch1_sub1_bn1"
 top: "hourglass1_branch1_res1_branch1_sub1_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_relu1"
 type: "ReLU"
 bottom: "hourglass1_branch1_res1_branch1_sub1_scale1"
 top: "hourglass1_branch1_res1_branch1_sub1_relu1"
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_conv1"
 type: "Convolution"
 bottom: "hourglass1_branch1_res1_branch1_sub1_relu1"
 top: "hourglass1_branch1_res1_branch1_sub1_conv1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_bn2"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res1_branch1_sub1_conv1"
 top: "hourglass1_branch1_res1_branch1_sub1_bn2"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_scale2"
 type: "Scale"
 bottom: "hourglass1_branch1_res1_branch1_sub1_bn2"
 top: "hourglass1_branch1_res1_branch1_sub1_scale2"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_relu2"
 type: "ReLU"
 bottom: "hourglass1_branch1_res1_branch1_sub1_scale2"
 top: "hourglass1_branch1_res1_branch1_sub1_relu2"
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_conv2"
 type: "Convolution"
 bottom: "hourglass1_branch1_res1_branch1_sub1_relu2"
 top: "hourglass1_branch1_res1_branch1_sub1_conv2"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_bn3"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res1_branch1_sub1_conv2"
 top: "hourglass1_branch1_res1_branch1_sub1_bn3"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_scale3"
 type: "Scale"
 bottom: "hourglass1_branch1_res1_branch1_sub1_bn3"
 top: "hourglass1_branch1_res1_branch1_sub1_scale3"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_relu3"
 type: "ReLU"
 bottom: "hourglass1_branch1_res1_branch1_sub1_scale3"
 top: "hourglass1_branch1_res1_branch1_sub1_relu3"
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_conv3"
 type: "Convolution"
 bottom: "hourglass1_branch1_res1_branch1_sub1_relu3"
 top: "hourglass1_branch1_res1_branch1_sub1_conv3"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_bn1"
 type: "BatchNorm"
 bottom: "hourglass1_pooling"
 top: "hourglass1_branch1_res1_branch1_sub2_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_scale1"
 type: "Scale"
 bottom: "hourglass1_branch1_res1_branch1_sub2_bn1"
 top: "hourglass1_branch1_res1_branch1_sub2_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_relu1"
 type: "ReLU"
 bottom: "hourglass1_branch1_res1_branch1_sub2_scale1"
 top: "hourglass1_branch1_res1_branch1_sub2_relu1"
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_conv1"
 type: "Convolution"
 bottom: "hourglass1_branch1_res1_branch1_sub2_relu1"
 top: "hourglass1_branch1_res1_branch1_sub2_conv1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_bn2"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res1_branch1_sub2_conv1"
 top: "hourglass1_branch1_res1_branch1_sub2_bn2"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_scale2"
 type: "Scale"
 bottom: "hourglass1_branch1_res1_branch1_sub2_bn2"
 top: "hourglass1_branch1_res1_branch1_sub2_scale2"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_relu2"
 type: "ReLU"
 bottom: "hourglass1_branch1_res1_branch1_sub2_scale2"
 top: "hourglass1_branch1_res1_branch1_sub2_relu2"
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_conv2"
 type: "Convolution"
 bottom: "hourglass1_branch1_res1_branch1_sub2_relu2"
 top: "hourglass1_branch1_res1_branch1_sub2_conv2"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_concat"
 type: "Concat"
 bottom: "hourglass1_branch1_res1_branch1_sub1_conv3"
 top: "hourglass1_branch1_res1_branch1_concat"
 bottom: "hourglass1_branch1_res1_branch1_sub2_conv2"
 concat_param {
 axis: 1
 }
}
layer {
 name: "hourglass1_branch1_res1_branch1_conv_linear"
 type: "Convolution"
 bottom: "hourglass1_branch1_res1_branch1_concat"
 top: "hourglass1_branch1_res1_branch1_conv_linear"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_linear_batch"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res1_branch1_conv_linear"
 top: "hourglass1_branch1_res1_branch1_linear_batch"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res1_branch1_linear_scale"
 type: "Scale"
 bottom: "hourglass1_branch1_res1_branch1_linear_batch"
 top: "hourglass1_branch1_res1_branch1_linear_scale"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch2_conv"
 type: "Convolution"
 bottom: "hourglass1_pooling"
 top: "hourglass1_branch1_res1_branch2_conv"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1"
 type: "Eltwise"
 bottom: "hourglass1_branch1_res1_branch1_linear_scale"
 top: "hourglass1_branch1_res1"
 bottom: "hourglass1_branch1_res1_branch2_conv"
 eltwise_param {
 operation: SUM
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_bn1"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res1"
 top: "hourglass1_branch1_res2_branch1_sub1_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_scale1"
 type: "Scale"
 bottom: "hourglass1_branch1_res2_branch1_sub1_bn1"
 top: "hourglass1_branch1_res2_branch1_sub1_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_relu1"
 type: "ReLU"
 bottom: "hourglass1_branch1_res2_branch1_sub1_scale1"
 top: "hourglass1_branch1_res2_branch1_sub1_relu1"
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_conv1"
 type: "Convolution"
 bottom: "hourglass1_branch1_res2_branch1_sub1_relu1"
 top: "hourglass1_branch1_res2_branch1_sub1_conv1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_bn2"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res2_branch1_sub1_conv1"
 top: "hourglass1_branch1_res2_branch1_sub1_bn2"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_scale2"
 type: "Scale"
 bottom: "hourglass1_branch1_res2_branch1_sub1_bn2"
 top: "hourglass1_branch1_res2_branch1_sub1_scale2"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_relu2"
 type: "ReLU"
 bottom: "hourglass1_branch1_res2_branch1_sub1_scale2"
 top: "hourglass1_branch1_res2_branch1_sub1_relu2"
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_conv2"
 type: "Convolution"
 bottom: "hourglass1_branch1_res2_branch1_sub1_relu2"
 top: "hourglass1_branch1_res2_branch1_sub1_conv2"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_bn3"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res2_branch1_sub1_conv2"
 top: "hourglass1_branch1_res2_branch1_sub1_bn3"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_scale3"
 type: "Scale"
 bottom: "hourglass1_branch1_res2_branch1_sub1_bn3"
 top: "hourglass1_branch1_res2_branch1_sub1_scale3"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_relu3"
 type: "ReLU"
 bottom: "hourglass1_branch1_res2_branch1_sub1_scale3"
 top: "hourglass1_branch1_res2_branch1_sub1_relu3"
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_conv3"
 type: "Convolution"
 bottom: "hourglass1_branch1_res2_branch1_sub1_relu3"
 top: "hourglass1_branch1_res2_branch1_sub1_conv3"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_bn1"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res1"
 top: "hourglass1_branch1_res2_branch1_sub2_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_scale1"
 type: "Scale"
 bottom: "hourglass1_branch1_res2_branch1_sub2_bn1"
 top: "hourglass1_branch1_res2_branch1_sub2_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_relu1"
 type: "ReLU"
 bottom: "hourglass1_branch1_res2_branch1_sub2_scale1"
 top: "hourglass1_branch1_res2_branch1_sub2_relu1"
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_conv1"
 type: "Convolution"
 bottom: "hourglass1_branch1_res2_branch1_sub2_relu1"
 top: "hourglass1_branch1_res2_branch1_sub2_conv1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_bn2"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res2_branch1_sub2_conv1"
 top: "hourglass1_branch1_res2_branch1_sub2_bn2"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_scale2"
 type: "Scale"
 bottom: "hourglass1_branch1_res2_branch1_sub2_bn2"
 top: "hourglass1_branch1_res2_branch1_sub2_scale2"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_relu2"
 type: "ReLU"
 bottom: "hourglass1_branch1_res2_branch1_sub2_scale2"
 top: "hourglass1_branch1_res2_branch1_sub2_relu2"
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_conv2"
 type: "Convolution"
 bottom: "hourglass1_branch1_res2_branch1_sub2_relu2"
 top: "hourglass1_branch1_res2_branch1_sub2_conv2"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_concat"
 type: "Concat"
 bottom: "hourglass1_branch1_res2_branch1_sub1_conv3"
 top: "hourglass1_branch1_res2_branch1_concat"
 bottom: "hourglass1_branch1_res2_branch1_sub2_conv2"
 concat_param {
 axis: 1
 }
}
layer {
 name: "hourglass1_branch1_res2_branch1_conv_linear"
 type: "Convolution"
 bottom: "hourglass1_branch1_res2_branch1_concat"
 top: "hourglass1_branch1_res2_branch1_conv_linear"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_linear_batch"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res2_branch1_conv_linear"
 top: "hourglass1_branch1_res2_branch1_linear_batch"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res2_branch1_linear_scale"
 type: "Scale"
 bottom: "hourglass1_branch1_res2_branch1_linear_batch"
 top: "hourglass1_branch1_res2_branch1_linear_scale"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch2_conv"
 type: "Convolution"
 bottom: "hourglass1_branch1_res1"
 top: "hourglass1_branch1_res2_branch2_conv"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2"
 type: "Eltwise"
 bottom: "hourglass1_branch1_res2_branch1_linear_scale"
 top: "hourglass1_branch1_res2"
 bottom: "hourglass1_branch1_res2_branch2_conv"
 eltwise_param {
 operation: SUM
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_bn1"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res2"
 top: "hourglass1_branch1_res3_branch1_sub1_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_scale1"
 type: "Scale"
 bottom: "hourglass1_branch1_res3_branch1_sub1_bn1"
 top: "hourglass1_branch1_res3_branch1_sub1_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_relu1"
 type: "ReLU"
 bottom: "hourglass1_branch1_res3_branch1_sub1_scale1"
 top: "hourglass1_branch1_res3_branch1_sub1_relu1"
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_conv1"
 type: "Convolution"
 bottom: "hourglass1_branch1_res3_branch1_sub1_relu1"
 top: "hourglass1_branch1_res3_branch1_sub1_conv1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_bn2"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res3_branch1_sub1_conv1"
 top: "hourglass1_branch1_res3_branch1_sub1_bn2"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_scale2"
 type: "Scale"
 bottom: "hourglass1_branch1_res3_branch1_sub1_bn2"
 top: "hourglass1_branch1_res3_branch1_sub1_scale2"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_relu2"
 type: "ReLU"
 bottom: "hourglass1_branch1_res3_branch1_sub1_scale2"
 top: "hourglass1_branch1_res3_branch1_sub1_relu2"
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_conv2"
 type: "Convolution"
 bottom: "hourglass1_branch1_res3_branch1_sub1_relu2"
 top: "hourglass1_branch1_res3_branch1_sub1_conv2"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_bn3"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res3_branch1_sub1_conv2"
 top: "hourglass1_branch1_res3_branch1_sub1_bn3"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_scale3"
 type: "Scale"
 bottom: "hourglass1_branch1_res3_branch1_sub1_bn3"
 top: "hourglass1_branch1_res3_branch1_sub1_scale3"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_relu3"
 type: "ReLU"
 bottom: "hourglass1_branch1_res3_branch1_sub1_scale3"
 top: "hourglass1_branch1_res3_branch1_sub1_relu3"
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_conv3"
 type: "Convolution"
 bottom: "hourglass1_branch1_res3_branch1_sub1_relu3"
 top: "hourglass1_branch1_res3_branch1_sub1_conv3"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_bn1"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res2"
 top: "hourglass1_branch1_res3_branch1_sub2_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_scale1"
 type: "Scale"
 bottom: "hourglass1_branch1_res3_branch1_sub2_bn1"
 top: "hourglass1_branch1_res3_branch1_sub2_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_relu1"
 type: "ReLU"
 bottom: "hourglass1_branch1_res3_branch1_sub2_scale1"
 top: "hourglass1_branch1_res3_branch1_sub2_relu1"
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_conv1"
 type: "Convolution"
 bottom: "hourglass1_branch1_res3_branch1_sub2_relu1"
 top: "hourglass1_branch1_res3_branch1_sub2_conv1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_bn2"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res3_branch1_sub2_conv1"
 top: "hourglass1_branch1_res3_branch1_sub2_bn2"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_scale2"
 type: "Scale"
 bottom: "hourglass1_branch1_res3_branch1_sub2_bn2"
 top: "hourglass1_branch1_res3_branch1_sub2_scale2"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_relu2"
 type: "ReLU"
 bottom: "hourglass1_branch1_res3_branch1_sub2_scale2"
 top: "hourglass1_branch1_res3_branch1_sub2_relu2"
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_conv2"
 type: "Convolution"
 bottom: "hourglass1_branch1_res3_branch1_sub2_relu2"
 top: "hourglass1_branch1_res3_branch1_sub2_conv2"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_concat"
 type: "Concat"
 bottom: "hourglass1_branch1_res3_branch1_sub1_conv3"
 top: "hourglass1_branch1_res3_branch1_concat"
 bottom: "hourglass1_branch1_res3_branch1_sub2_conv2"
 concat_param {
 axis: 1
 }
}
layer {
 name: "hourglass1_branch1_res3_branch1_conv_linear"
 type: "Convolution"
 bottom: "hourglass1_branch1_res3_branch1_concat"
 top: "hourglass1_branch1_res3_branch1_conv_linear"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_linear_batch"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_res3_branch1_conv_linear"
 top: "hourglass1_branch1_res3_branch1_linear_batch"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_res3_branch1_linear_scale"
 type: "Scale"
 bottom: "hourglass1_branch1_res3_branch1_linear_batch"
 top: "hourglass1_branch1_res3_branch1_linear_scale"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch2_conv"
 type: "Convolution"
 bottom: "hourglass1_branch1_res2"
 top: "hourglass1_branch1_res3_branch2_conv"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3"
 type: "Eltwise"
 bottom: "hourglass1_branch1_res3_branch1_linear_scale"
 top: "hourglass1_branch1_res3"
 bottom: "hourglass1_branch1_res3_branch2_conv"
 eltwise_param {
 operation: SUM
 }
 }
layer {
 name: "hourglass1_branch1_level4_pooling"
 type: "Pooling"
 bottom: "hourglass1_branch1_res3"
 top: "hourglass1_branch1_level4_pooling"
 pooling_param {
 pool: MAX
 kernel_size: 2
 stride: 2
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res1_branch1_bn1"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_level4_pooling"
 top: "hourglass1_branch1_level4_branch1_res1_branch1_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_level4_branch1_res1_branch1_scale1"
 type: "Scale"
 bottom: "hourglass1_branch1_level4_branch1_res1_branch1_bn1"
 top: "hourglass1_branch1_level4_branch1_res1_branch1_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res1_branch1_relu1"
 type: "ReLU"
 bottom: "hourglass1_branch1_level4_branch1_res1_branch1_scale1"
 top: "hourglass1_branch1_level4_branch1_res1_branch1_relu1"
}
layer {
 name: "hourglass1_branch1_level4_branch1_res1_branch1_conv1"
 type: "Convolution"
 bottom: "hourglass1_branch1_level4_branch1_res1_branch1_relu1"
 top: "hourglass1_branch1_level4_branch1_res1_branch1_conv1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res1_branch1_bn2"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_level4_branch1_res1_branch1_conv1"
 top: "hourglass1_branch1_level4_branch1_res1_branch1_bn2"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_level4_branch1_res1_branch1_scale2"
 type: "Scale"
 bottom: "hourglass1_branch1_level4_branch1_res1_branch1_bn2"
 top: "hourglass1_branch1_level4_branch1_res1_branch1_scale2"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res1_branch1_relu2"
 type: "ReLU"
 bottom: "hourglass1_branch1_level4_branch1_res1_branch1_scale2"
 top: "hourglass1_branch1_level4_branch1_res1_branch1_relu2"
}
layer {
 name: "hourglass1_branch1_level4_branch1_res1_branch1_conv2"
 type: "Convolution"
 bottom: "hourglass1_branch1_level4_branch1_res1_branch1_relu2"
 top: "hourglass1_branch1_level4_branch1_res1_branch1_conv2"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res1_branch1_bn3"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_level4_branch1_res1_branch1_conv2"
 top: "hourglass1_branch1_level4_branch1_res1_branch1_bn3"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_level4_branch1_res1_branch1_scale3"
 type: "Scale"
 bottom: "hourglass1_branch1_level4_branch1_res1_branch1_bn3"
 top: "hourglass1_branch1_level4_branch1_res1_branch1_scale3"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res1_branch1_relu3"
 type: "ReLU"
 bottom: "hourglass1_branch1_level4_branch1_res1_branch1_scale3"
 top: "hourglass1_branch1_level4_branch1_res1_branch1_relu3"
}
layer {
 name: "hourglass1_branch1_level4_branch1_res1_branch1_conv3"
 type: "Convolution"
 bottom: "hourglass1_branch1_level4_branch1_res1_branch1_relu3"
 top: "hourglass1_branch1_level4_branch1_res1_branch1_conv3"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res1_branch2_conv"
 type: "Convolution"
 bottom: "hourglass1_branch1_level4_pooling"
 top: "hourglass1_branch1_level4_branch1_res1_branch2_conv"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res1"
 type: "Eltwise"
 bottom: "hourglass1_branch1_level4_branch1_res1_branch1_conv3"
 top: "hourglass1_branch1_level4_branch1_res1"
 bottom: "hourglass1_branch1_level4_branch1_res1_branch2_conv"
 eltwise_param {
 operation: SUM
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res2_branch1_bn1"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_level4_branch1_res1"
 top: "hourglass1_branch1_level4_branch1_res2_branch1_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_level4_branch1_res2_branch1_scale1"
 type: "Scale"
 bottom: "hourglass1_branch1_level4_branch1_res2_branch1_bn1"
 top: "hourglass1_branch1_level4_branch1_res2_branch1_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res2_branch1_relu1"
 type: "ReLU"
 bottom: "hourglass1_branch1_level4_branch1_res2_branch1_scale1"
 top: "hourglass1_branch1_level4_branch1_res2_branch1_relu1"
}
layer {
 name: "hourglass1_branch1_level4_branch1_res2_branch1_conv1"
 type: "Convolution"
 bottom: "hourglass1_branch1_level4_branch1_res2_branch1_relu1"
 top: "hourglass1_branch1_level4_branch1_res2_branch1_conv1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res2_branch1_bn2"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_level4_branch1_res2_branch1_conv1"
 top: "hourglass1_branch1_level4_branch1_res2_branch1_bn2"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_level4_branch1_res2_branch1_scale2"
 type: "Scale"
 bottom: "hourglass1_branch1_level4_branch1_res2_branch1_bn2"
 top: "hourglass1_branch1_level4_branch1_res2_branch1_scale2"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res2_branch1_relu2"
 type: "ReLU"
 bottom: "hourglass1_branch1_level4_branch1_res2_branch1_scale2"
 top: "hourglass1_branch1_level4_branch1_res2_branch1_relu2"
}
layer {
 name: "hourglass1_branch1_level4_branch1_res2_branch1_conv2"
 type: "Convolution"
 bottom: "hourglass1_branch1_level4_branch1_res2_branch1_relu2"
 top: "hourglass1_branch1_level4_branch1_res2_branch1_conv2"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res2_branch1_bn3"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_level4_branch1_res2_branch1_conv2"
 top: "hourglass1_branch1_level4_branch1_res2_branch1_bn3"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_level4_branch1_res2_branch1_scale3"
 type: "Scale"
 bottom: "hourglass1_branch1_level4_branch1_res2_branch1_bn3"
 top: "hourglass1_branch1_level4_branch1_res2_branch1_scale3"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res2_branch1_relu3"
 type: "ReLU"
 bottom: "hourglass1_branch1_level4_branch1_res2_branch1_scale3"
 top: "hourglass1_branch1_level4_branch1_res2_branch1_relu3"
}
layer {
 name: "hourglass1_branch1_level4_branch1_res2_branch1_conv3"
 type: "Convolution"
 bottom: "hourglass1_branch1_level4_branch1_res2_branch1_relu3"
 top: "hourglass1_branch1_level4_branch1_res2_branch1_conv3"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res2_branch2_conv"
 type: "Convolution"
 bottom: "hourglass1_branch1_level4_branch1_res1"
 top: "hourglass1_branch1_level4_branch1_res2_branch2_conv"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res2"
 type: "Eltwise"
 bottom: "hourglass1_branch1_level4_branch1_res2_branch1_conv3"
 top: "hourglass1_branch1_level4_branch1_res2"
 bottom: "hourglass1_branch1_level4_branch1_res2_branch2_conv"
 eltwise_param {
 operation: SUM
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res3_branch1_bn1"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_level4_branch1_res2"
 top: "hourglass1_branch1_level4_branch1_res3_branch1_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_level4_branch1_res3_branch1_scale1"
 type: "Scale"
 bottom: "hourglass1_branch1_level4_branch1_res3_branch1_bn1"
 top: "hourglass1_branch1_level4_branch1_res3_branch1_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res3_branch1_relu1"
 type: "ReLU"
 bottom: "hourglass1_branch1_level4_branch1_res3_branch1_scale1"
 top: "hourglass1_branch1_level4_branch1_res3_branch1_relu1"
}
layer {
 name: "hourglass1_branch1_level4_branch1_res3_branch1_conv1"
 type: "Convolution"
 bottom: "hourglass1_branch1_level4_branch1_res3_branch1_relu1"
 top: "hourglass1_branch1_level4_branch1_res3_branch1_conv1"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res3_branch1_bn2"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_level4_branch1_res3_branch1_conv1"
 top: "hourglass1_branch1_level4_branch1_res3_branch1_bn2"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_level4_branch1_res3_branch1_scale2"
 type: "Scale"
 bottom: "hourglass1_branch1_level4_branch1_res3_branch1_bn2"
 top: "hourglass1_branch1_level4_branch1_res3_branch1_scale2"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res3_branch1_relu2"
 type: "ReLU"
 bottom: "hourglass1_branch1_level4_branch1_res3_branch1_scale2"
 top: "hourglass1_branch1_level4_branch1_res3_branch1_relu2"
}
layer {
 name: "hourglass1_branch1_level4_branch1_res3_branch1_conv2"
 type: "Convolution"
 bottom: "hourglass1_branch1_level4_branch1_res3_branch1_relu2"
 top: "hourglass1_branch1_level4_branch1_res3_branch1_conv2"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res3_branch1_bn3"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_level4_branch1_res3_branch1_conv2"
 top: "hourglass1_branch1_level4_branch1_res3_branch1_bn3"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_level4_branch1_res3_branch1_scale3"
 type: "Scale"
 bottom: "hourglass1_branch1_level4_branch1_res3_branch1_bn3"
 top: "hourglass1_branch1_level4_branch1_res3_branch1_scale3"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res3_branch1_relu3"
 type: "ReLU"
 bottom: "hourglass1_branch1_level4_branch1_res3_branch1_scale3"
 top: "hourglass1_branch1_level4_branch1_res3_branch1_relu3"
}
layer {
 name: "hourglass1_branch1_level4_branch1_res3_branch1_conv3"
 type: "Convolution"
 bottom: "hourglass1_branch1_level4_branch1_res3_branch1_relu3"
 top: "hourglass1_branch1_level4_branch1_res3_branch1_conv3"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res3_branch2_conv"
 type: "Convolution"
 bottom: "hourglass1_branch1_level4_branch1_res2"
 top: "hourglass1_branch1_level4_branch1_res3_branch2_conv"
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param {
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler {
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_res3"
 type: "Eltwise"
 bottom: "hourglass1_branch1_level4_branch1_res3_branch1_conv3"
 top: "hourglass1_branch1_level4_branch1_res3"
 bottom: "hourglass1_branch1_level4_branch1_res3_branch2_conv"
 eltwise_param {
 operation: SUM
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_level3_pooling"
 type: "Pooling"
 bottom: "hourglass1_branch1_level4_branch1_res3"
 top: "hourglass1_branch1_level4_branch1_level3_pooling"
 pooling_param {
 pool: MAX
 kernel_size: 2
 stride: 2
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_level3_branch1_res1_branch1_bn1"
 type: "BatchNorm"
 bottom: "hourglass1_branch1_level4_branch1_level3_pooling"
 top: "hourglass1_branch1_level4_branch1_level3_branch1_res1_branch1_bn1"
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
 param {
 lr_mult: 0
 }
}
layer {
 name: "hourglass1_branch1_level4_branch1_level3_branch1_res1_branch1_scale1"
 type: "Scale"
 bottom: "hourglass1_branch1_level4_branch1_level3_branch1_res1_branch1_bn1"
 top: "hourglass1_branch1_level4_branch1_level3_branch1_res1_branch1_scale1"
 scale_param {
 bias_term: true
 }
 }
layer {
 name: "hourglass1_branch1_level4_branch1_level3_branch1_res1_branch1_relu1"
 type: "ReLU"
 bottom: "hourglass1_branch1_level4_branch1_level3_branch1_res1_branch1_scale1"
 top: "hourglass1_branch1_level4_branch1_level3_branch1_res1_branch1_relu1"
}
layer {
 name: "hourglass1_branch1_level4_branch1_level3_branch1_res1_branch1_conv1"
 type: "Convolution"
 bottom: "hourglass1_branch1_level4_branch1_level3_branch1_res1_branch1_relu1"
 top: "hourglass1_branch1_level4_branch1_level3_branch1_res1_branch1_conv1"
  param {
 	 lr_mult: 1
